df4/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

species (ma_vr h2o);

phases (oil water);

rho1             rho1  [ 1 -3 0 0 0 0 0 ] 900;

rho0             rho0  [ 1 -3 0 0 0 0 0 ] 275;

mu1              mu1   [ 1 -1 -1 0 0 0 0 ] 7e-4;

mu0              mu0   [ 1 -1 -1 0 0 0 0 ] 3.7e-5;

sigma            sigma [ 1 0 -2 0 0 0 0 ]  0.003;

D10              D10   [ 0 1 -2 0 0 0 0 ]  1e-8;
D11              D11   [ 0 1 -2 0 0 0 0 ]  1e-8;

D00              D00   [ 0 1 -2 0 0 0 0 ]  1e-7;
D01              D01   [ 0 1 -2 0 0 0 0 ]  1e-7;

Ys10             Ys10  [ 0 0 0 0 0 0 0 ]  0.7;
Ys11             Ys11  [ 0 0 0 0 0 0 0 ]  0.3;

Ys00             Ys00  [ 0 0 0 0 0 0 0 ]  0.2;
Ys01             Ys01  [ 0 0 0 0 0 0 0 ]  0.8;


ALPHA_BOUND_ERR  1e-15;
ALPHA_2PH_MIN    1e-09;
GRADALPHA_MIN    1e-03;
ALPHA_TOL        1e-12;
DIST_TOL         1e-15;
PT_DIST_TOL      1e-15;
SMALLEST_TET_VOL 1e-27;
SMALLEST_PHI     1e-21;
SMALLEST_ALPHA_FOR_YADV  1e-15;
SMALLEST_ALPHA_FOR_YDIFF 1e-15;
MIN_ALPHA_DIFF   1e-09;
MAX_BRENT_ITERS  512;

redist_alpha     yes;

phi_interp_debug no;
plic_debug       no;
plic_debug2      no;
plic_debugIR     no; 
plic_debugIR2    no;
plic_debugF      no;
plic_debugF2     no;
alpha_debug      no;
adv_debug        no;
adv_debug2       no;
ist_debug        no;
ist_debug2       no;
diff_debug       no;
diff_debug2      no;

// ************************************************************************* //
